Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem Properties
The CoordinateSystem type exposes the following members.
Properties
Name | Description
AxisX
 The X-axis of the coordinate system.
AxisY
 The Y-axis of the coordinate system.
Origin
 The origin of the coordinate system.
Top
See Also
Reference
CoordinateSystem Class
Tekla.Structures.Geometry3d Namespace